package javaRush;
//Напишите программу, которая будет выводить числа от 1 до 10.
public class Cicle3 {
    public static void main(String[] args) {
        int a = 1;

        while (a<=10){
            System.out.println(a);
            a++;

        }
    }
}
