package javaRush;
//Напишите программу, которая будет выводить таблицу умножения на 5 до 10.
public class Cicle4 {
    public static void main(String[] args) {
        int a = 1;
        int b = 5;
        while (a<=10){
            System.out.println(a+"*"+b+"="+a*b);
            a++;
        }
    }
}
